Article: On the estimation of average treatment effects with
right-censored time to event outcome and competing risks (link: https://doi.org/10.1002/bimj.201800298)

Authors: Julien Péron, Maryam Idlhaj, Delphine Maucort-Boulch, Joris Giai, Pascal Roy, Laurence Collette, Marc Buyse, Brice Ozenne

Authors responsible for writing the code: Brice Ozenne and Julien Péron.

E-mail of the author maintaining the code: brice.mh.ozenne@gmail.com

* Content of the folder
The infra structure of the empirical studies presented in the
manuscript is organized as follow:
- *the BATCH files* define the simulation studies. Each file was
  excecuted 20 times using a different id (obtain using
  =Sys.getenv("SGE_TASK_ID")= in R) and therefore a different seed
  when randomly generating the data. The output of the simulations
  were saved in a =results= directory, not uploaded on Github to save
  space but available upon request.  

- *the BUILD file* gather the results of the various simulations by
  reading the data in the =Results/scenarioX-XXX= directory, exports
  them in the =Results= directory (files =dtS-scenarioX.rds=).

- *the ANALYSIS files* contains the code used to perform the analyses
  of the two illustrative datasets.

- *the figure files* produces figure 1 of the main article and figures
  A-E of the supplementary material.

- *the table files* produces table 3-5 of the main article.

- *the software directory* contains the BuyseTest package used for the
  simulations and data analysis.

- *the SM file* contains the code to reproduce the calculation done in
  supplementary material of the expected value of the net benefit in
  scenario 3 and 4.

- *the figure folder* contains the figures generated by the figure
  files in pdf and png format.

* R and package versions

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(BuyseTest)
sessionInfo()
#+END_SRC

#+RESULTS:
#+begin_example
Loading required package: Rcpp
BuyseTest version 2.2.0
R version 4.0.2 (2020-06-22)
Platform: x86_64-w64-mingw32/x64 (64-bit)
Running under: Windows 7 x64 (build 7601) Service Pack 1

Matrix products: default

locale:
[1] LC_COLLATE=Danish_Denmark.1252  LC_CTYPE=Danish_Denmark.1252    LC_MONETARY=Danish_Denmark.1252
[4] LC_NUMERIC=C                    LC_TIME=Danish_Denmark.1252    

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] BuyseTest_2.2.0 Rcpp_1.0.5     

loaded via a namespace (and not attached):
 [1] compiler_4.0.2     Matrix_1.2-18      parallel_4.0.2     survival_3.1-12    prodlim_2019.11.13 splines_4.0.2     
 [7] grid_4.0.2         data.table_1.13.0  lava_1.6.7         stats4_4.0.2       lattice_0.20-41
#+end_example
